CSI API ETABS v1
cDCoIndian_IS_456_2000 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCoIndian_IS_456_2000
Public Interface cDCoIndian_IS_456_2000
Dim instance As cDCoIndian_IS_456_2000
public interface class cDCoIndian_IS_456_2000
type cDCoIndian_IS_456_2000 =  interface end
The cDCoIndian_IS_456_2000 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a concrete design overwrite item.
GetPreference
 Retrieves the value of a concrete design preference item.
SetOverwrite
 Sets the value of a concrete design overwrite item.
SetPreference
 Sets the value of a concrete design preference item.
Top
See Also
Reference
ETABSv1 Namespace